[
  {
    "id": 1,
    "title": "mintab",
    "img": "img/mintab.jpg",
    "gif": "img/mintab-gif.gif",
    "github": "https://github.com/Jack-LP/mintab",
    "liveSite": "https://mintab.vercel.app",
    "desc": "Mintab is a customisable homepage for your browser, providing quick access to bookmarked sites. Every display component is customised through a settings drawer built with Chakra UI. User settings are managed through state and context, and then stored in localStorage to persist through page refreshes.",
    "stack": ["NextJS", "Chakra UI"]
  },
  {
    "id": 2,
    "title": "game grid",
    "img": "img/gamegrid.jpg",
    "gif": "img/gamegrid-gif.gif",
    "github": "https://github.com/Jack-LP/Game-Grid",
    "liveSite": "https://gamegrid.vercel.app",
    "desc": "Game Grid is an e-commerce site and directory of free-to-play games. Data is pulled from the 'freetogame' API and displayed through various pages using React Router. Clicking on a game displays additional information within its own dynamic route. Games can also be searched for and filtered by genre.",
    "stack": ["React", "Chakra UI", "React Router", "Freetogame API"]
  },
  {
    "id": 3,
    "title": "pomodoro",
    "img": "img/pomodoro.jpg",
    "gif": "img/pomodoro-gif.gif",
    "github": "https://github.com/Jack-LP/pomodoro",
    "liveSite": "https://react-pomodoro-jp.vercel.app/",
    "desc": "This is a simple pomodoro timer app built with React and Tailwind CSS. The three timing intervals are customisable in the settings panel, in which the theme and font of the app can also be changed.",
    "stack": ["Vite", "React", "Tailwind"]
  },
  {
    "id": 4,
    "title": "swatch",
    "img": "img/swatch.jpg",
    "gif": "img/swatch-gif.gif",
    "github": "https://github.com/Jack-LP/swatch",
    "liveSite": "https://swatch-jp.vercel.app/",
    "desc": "Swatch is a design tool used to create palettes and extract colors from an image. It allows image uploads via direct link or files and outputs a palette of colors. You can click on any of the generated colors to copy the hex value to your clipboard.",
    "stack": ["Vite", "React", "Tailwind"]
  }
]
